[
  {
    "id": "SN001",
    "date": "2025-10-30",
    "title": "Nike Drops Limited Edition 'Infrared' Air Max 90 Reissue",
    "content": "The iconic Air Max 90 'Infrared' makes a highly anticipated return with a slight modern update while keeping its classic colorway and silhouette. Available globally this Saturday.",
    "category": "Release"
  },
  {
    "id": "SN002",
    "date": "2025-10-29",
    "title": "Exclusive Interview: How Sustainable Materials are Changing Sneaker Design at Adidas",
    "content": "We sat down with Adidas' Head of Innovation to discuss their transition to recycled and bio-based materials, and the challenges of maintaining performance and style.",
    "category": "Industry"
  },
  {
    "id": "SN003",
    "date": "2025-10-28",
    "title": "Air Jordan 4 'Midnight Navy' Sells Out Instantly in European Release",
    "content": "The retro Air Jordan 4 in the 'Midnight Navy' colorway saw an immediate sell-out across major European retailers, leading to high resale prices on secondary markets.",
    "category": "Hype"
  },
  {
    "id": "SN004",
    "date": "2025-10-27",
    "title": "Review: New Balance 990v6 – The Best Running Shoe of the Year?",
    "content": "Our in-depth test of the latest New Balance 990 model reveals major cushioning improvements and a refined silhouette that bridges performance and lifestyle.",
    "category": "Review"
  },
  {
    "id": "SN005",
    "date": "2025-10-25",
    "title": "Travis Scott x Fragment Teases Upcoming Sneaker Collaboration",
    "content": "A leaked image shows a potential new collaborative silhouette from Travis Scott and Fragment Design, suggesting another high-profile release is on the horizon.",
    "category": "Rumors"
  },
  {
    "id": "SN006",
    "date": "2025-10-25",
    "title": "Puma Revives 'Suede Classic' with New Fall Color Palette",
    "content": "Puma announces a refreshing batch of earthy tones and deep colors for their timeless Suede Classic line, set to launch next week at select retailers.",
    "category": "Release"
  },
  {
    "id": "SN007",
    "date": "2025-10-24",
    "title": "The Rise of HOKA: Why Runners and Fashionistas are Loving the 'Clifton' Series",
    "content": "An analysis of HOKA's surprising dominance in both the marathon and 'dad shoe' trends, focusing on the maximalist design of the Clifton and Bondi models.",
    "category": "Analysis"
  },
  {
    "id": "SN008",
    "date": "2025-10-23",
    "title": "Off-White x Converse Chuck 70 'Stripe' Re-Release Confirmed",
    "content": "Converse officially confirms the re-release date for the highly sought-after Off-White collaboration, sending shockwaves through the sneaker community.",
    "category": "Release"
  },
  {
    "id": "SN009",
    "date": "2025-10-22",
    "title": "StockX Reports Highest Resale Numbers for September on Dunk Lows",
    "content": "The latest market report from StockX indicates that various Nike Dunk Low colorways were the top performers in the resale market last month.",
    "category": "Market Data"
  },
  {
    "id": "SN010",
    "date": "2025-10-21",
    "title": "Behind the Design: The Craftsmanship of the ASICS GEL-LYTE III",
    "content": "A deep dive into the history and unique split-tongue design of the enduring ASICS GEL-LYTE III silhouette, and its cultural impact over the decades.",
    "category": "History"
  },
  {
    "id": "SN011",
    "date": "2025-10-20",
    "title": "Patta Unveils Final Colorway in 'The Wave' Air Max 1 Series",
    "content": "Dutch brand Patta concludes its successful collaboration series with a striking new color combination for the classic Air Max 1, dropping exclusively in Amsterdam.",
    "category": "Release"
  },
  {
    "id": "SN012",
    "date": "2025-10-19",
    "title": "Are Sneaker NFTs the Future of Authentication? A Digital Deep Dive",
    "content": "Exploring how major brands are using Non-Fungible Tokens (NFTs) to create digital twins of physical sneakers for enhanced verification and ownership.",
    "category": "Technology"
  },
  {
    "id": "SN013",
    "date": "2025-10-18",
    "title": "First Look: LeBron James' Next Signature Shoe, the Nike LeBron 23",
    "content": "A sneak peek at the performance model LeBron is expected to debut for the upcoming NBA season, featuring a new, lightweight cushioning system.",
    "category": "Rumors"
  },
  {
    "id": "SN014",
    "date": "2025-10-17",
    "title": "Adidas 'Yeezy' Inventory to be Sold Off: What Happens Next?",
    "content": "Following the partnership termination, Adidas finalizes plans for the remaining 'Yeezy' stock, which will be released in phases with a portion of profits going to charity.",
    "category": "Industry"
  },
  {
    "id": "SN015",
    "date": "2025-10-16",
    "title": "Vans Vault Announces Collaboration with Japanese Artist Murakami",
    "content": "Vans' premium Vault line teases a colorful, limited collection featuring the signature flower and skull motifs of renowned artist Takashi Murakami.",
    "category": "Collaboration"
  },
  {
    "id": "SN016",
    "date": "2025-10-15",
    "title": "The 10 Most Underrated Sneaker Silhouettes for Fall 2025",
    "content": "Our fashion experts pick out a list of overlooked models from brands like Saucony, Diadora, and Reebok that deserve a spot in your seasonal rotation.",
    "category": "Lifestyle"
  },
  {
    "id": "SN017",
    "date": "2025-10-14",
    "title": "Nike ACG Trail Shoe 'Mountain Fly' Gets a GORE-TEX Update",
    "content": "Nike's All Conditions Gear division releases an upgraded version of the popular 'Mountain Fly' with a waterproof GORE-TEX shell, perfect for winter trekking.",
    "category": "Release"
  },
  {
    "id": "SN018",
    "date": "2025-10-13",
    "title": "Can Sneaker Cleaner Kits Damage Premium Suede? Expert Tips",
    "content": "A detailed guide on safely cleaning delicate materials like premium suede and nubuck on collector-grade sneakers without causing irreversible damage.",
    "category": "Maintenance"
  },
  {
    "id": "SN019",
    "date": "2025-10-12",
    "title": "Why the New Balance 550 Continues to Dominate the Streetwear Scene",
    "content": "A look at the vintage basketball model's resurgence, its strategic collaborations, and its simple design that has made it a current cultural phenomenon.",
    "category": "Analysis"
  },
  {
    "id": "SN020",
    "date": "2025-10-11",
    "title": "Air Jordan 1 'Panda' Lows Postponed: New Release Date Inside",
    "content": "Retailers confirm a delay for the highly anticipated Air Jordan 1 Low 'Panda' colorway. We have the updated official launch date and release locations.",
    "category": "Release"
  },
  {
    "id": "SN021",
    "date": "2025-10-10",
    "title": "The 'Dad Shoe' Trend is Officially Over, Says Industry Analyst",
    "content": "A controversial piece arguing that chunky, retro-inspired trainers are giving way to sleek, minimalist designs in the next wave of sneaker fashion.",
    "category": "Trend"
  },
  {
    "id": "SN022",
    "date": "2025-10-09",
    "title": "A Look Back at the Most Expensive Sneaker Auctions of 2025",
    "content": "Recapping the top-selling, rarest sneakers that hit the auction block this year, including game-worn pairs and one-of-one samples.",
    "category": "Market Data"
  },
  {
    "id": "SN023",
    "date": "2025-10-08",
    "title": "Kobe Bryant's Signature Line Continues with 'Protro' Relaunches",
    "content": "Nike confirms the ongoing commitment to the late Kobe Bryant's legacy by reissuing several fan-favorite models with updated 'Protro' performance technology.",
    "category": "Release"
  },
  {
    "id": "SN024",
    "date": "2025-10-07",
    "title": "Concepts x Reebok Question Mid 'Lakers' Colorway Revealed",
    "content": "Sneaker boutique Concepts unveils a special-edition Reebok Question Mid model inspired by the Los Angeles Lakers' championship colors.",
    "category": "Collaboration"
  },
  {
    "id": "SN025",
    "date": "2025-10-06",
    "title": "How to Cop Exclusive Drops: Tips from Sneaker Bot Developers",
    "content": "An exposé on the technology and tactics used by bot developers to secure limited-edition releases, and how retailers are fighting back.",
    "category": "Hype"
  },
  {
    "id": "SN026",
    "date": "2025-10-05",
    "title": "Vans Skateboarding Drops New Signature Model for Tony Hawk",
    "content": "Skateboarding legend Tony Hawk receives his second pro model from Vans, designed for high-impact performance and featuring a reinforced waffle sole.",
    "category": "Performance"
  },
  {
    "id": "SN027",
    "date": "2025-10-04",
    "title": "Sustainable Sneaker Watch: Allbirds Launches 'Tree Dasher 3'",
    "content": "Allbirds updates its popular running shoe with even more focus on natural materials, claiming a lower carbon footprint than any of its previous versions.",
    "category": "Review"
  },
  {
    "id": "SN028",
    "date": "2025-10-03",
    "title": "The Most Iconic Sneaker Colorways of All Time",
    "content": "A retrospective article exploring the origins and cultural significance of color schemes like 'Bred,' 'Chicago,' and 'Grape' in sneaker history.",
    "category": "History"
  },
  {
    "id": "SN029",
    "date": "2025-10-02",
    "title": "Rumored Sacai x Nike Waffle Collaboration Surfaces in Patent Leather",
    "content": "Unconfirmed photos suggest Sacai is preparing another dual-layered Nike Waffle release, this time experimenting with a glossy, patent leather finish.",
    "category": "Rumors"
  },
  {
    "id": "SN030",
    "date": "2025-10-01",
    "title": "Collector Spotlight: Meeting the Man with Over 1,000 Pairs of Deadstock Sneakers",
    "content": "We visit the impressive, temperature-controlled vault of a dedicated collector to learn his secrets for maintaining a massive, unworn sneaker collection.",
    "category": "Lifestyle"
  }
]